Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_2: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "do_not_use_in_code" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Ps3BwcBajFi5wMcx/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.kubernetes.module.postgresql.kubernetes_config_map.sql_scripts will be created
+ resource "kubernetes_config_map" "sql_scripts" {
      + data = {
          + "thirtyinches_schema.sql" = <<-EOT
                -- Users table
                CREATE TABLE IF NOT EXISTS Users (
                    user_id SERIAL PRIMARY KEY,
                    email VARCHAR(255) NOT NULL UNIQUE,
                    first_name VARCHAR(255) NOT NULL,
                    last_name VARCHAR(255) NOT NULL,
                    created_at TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP
                );
                
                -- -- Plans table
                -- CREATE TABLE IF NOT EXISTS Plans (
                --     plan_id SERIAL PRIMARY KEY,
                --     name VARCHAR(255) NOT NULL,
                --     description TEXT NOT NULL,
                --     price DECIMAL(10, 2) NOT NULL,
                --     period_type ENUM('MONTHLY', 'YEARLY') NOT NULL,
                --     trial_days INTEGER DEFAULT NULL
                -- );
                
                -- -- Subscriptions table
                -- CREATE TABLE IF NOT EXISTS Subscriptions (
                --     subscription_id SERIAL PRIMARY KEY,
                --     user_id INTEGER NOT NULL,
                --     plan_id INTEGER NOT NULL,
                --     start_date TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP,
                --     end_date TIMESTAMP WITHOUT TIME ZONE DEFAULT NULL,
                --     status ENUM('active', 'cancelled', 'expired') NOT NULL DEFAULT 'active',
                --     payment_method VARCHAR(255) DEFAULT NULL,
                --     FOREIGN KEY (user_id) REFERENCES Users(user_id) ON DELETE CASCADE,
                --     FOREIGN KEY (plan_id) REFERENCES Plans(plan_id) ON DELETE RESTRICT
                -- );
                
                -- -- Transactions table
                -- CREATE TABLE IF NOT EXISTS Transactions (
                --     transaction_id SERIAL PRIMARY KEY,
                --     subscription_id INTEGER NOT NULL,
                --     amount DECIMAL(10, 2) NOT NULL,
                --     payment_date TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP,
                --     payment_method VARCHAR(255) DEFAULT NULL,
                --     status ENUM('successful', 'failed', 'pending') NOT NULL DEFAULT 'pending',
                --     FOREIGN KEY (subscription_id) REFERENCES Subscriptions(subscription_id) ON DELETE CASCADE
                -- );
                
                -- -- Add any additional tables or constraints as needed
                -- -- Example of adding an index on email for faster lookup
                -- CREATE INDEX idx_users_email ON Users(email);
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "sql-scripts"
          + namespace        = "postgresql"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts will be created
+ resource "kubernetes_job" "run_sql_scripts" {
      + id                  = (known after apply)
      + wait_for_completion = true

      + metadata {
          + generation       = (known after apply)
          + labels           = (known after apply)
          + name             = "run-sql-scripts"
          + namespace        = "postgresql"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backoff_limit   = 6
          + completion_mode = (known after apply)
          + completions     = 1
          + parallelism     = 1

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Never"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + command                    = [
                          + "psql",
                          + "-h",
                          + "localhost",
                          + "-d",
                          + "thirtyinches",
                          + "-f",
                          + "/scripts/thirtyinches_schema.sql",
                        ]
                      + image                      = "jbergknoff/postgresql-client"
                      + image_pull_policy          = (known after apply)
                      + name                       = "postgres-client"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "POSTGRES_USER"
                          + value = (sensitive value)
                        }
                      + env {
                          + name  = "POSTGRES_PASSWORD"
                          + value = (sensitive value)
                        }

                      + volume_mount {
                          + mount_path        = "/scripts"
                          + mount_propagation = "None"
                          + name              = "sql-scripts-volume"
                          + read_only         = false
                        }
                    }

                  + volume {
                      + name = "sql-scripts-volume"

                      + config_map {
                          + default_mode = "0644"
                          + name         = "sql-scripts"
                        }
                    }
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`